<div class=one>

Name: Fatima Momin  <br>
Email: fatimamomina423@gmail.com  <br>
GitHub: https://github.com/dashboard  <br>
Title:  Pandas Practice <br>

</div>

<style>
.one {
    color: red;
    text-align:center;
}

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
%pip install numpy
import numpy as np

Requirement already satisfied: numpy in c:\users\administrator\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

**Series Function**

In [4]:
df=pd.read_csv('data.csv')
df

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [5]:
Series=pd.Series([1, 2, 3, 4, 5])
Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

**Date Range**

In [6]:
Range=pd.date_range("20250318", periods=6)#yearmonthday   period days
Range

DatetimeIndex(['2025-03-18', '2025-03-19', '2025-03-20', '2025-03-21',
               '2025-03-22', '2025-03-23'],
              dtype='datetime64[ns]', freq='D')

In [7]:
Frame= pd.DataFrame(   #IMPORTANT
    {
    "Name": pd.Series(["Fatima Momin","Faiqa Nazeer","Kousar Hanif"]),
    "Email": pd.Series(["fatimamomin423@gmail.com","faiqanazeer3@gmail.com","kousar23@gmail.com"]),
    "Contact": pd.Series(["0333 1491752","0123 4516789","0999 1111111"]),
     #A B C are features and their indexes are values
    }
     
)
Frame

           Name                     Email       Contact
0  Fatima Momin  fatimamomin423@gmail.com  0333 1491752
1  Faiqa Nazeer    faiqanazeer3@gmail.com  0123 4516789
2  Kousar Hanif        kousar23@gmail.com  0999 1111111

In [8]:
Frame.head(1)

           Name                     Email       Contact
0  Fatima Momin  fatimamomin423@gmail.com  0333 1491752

In [9]:
Frame.tail(1)

           Name               Email       Contact
2  Kousar Hanif  kousar23@gmail.com  0999 1111111

In [10]:
Frame.loc[2]

Name             Kousar Hanif
Email      kousar23@gmail.com
Contact          0999 1111111
Name: 2, dtype: object

In [11]:
df.dtypes

Name            object
Designation     object
Gender          object
Age            float64
Salary         float64
dtype: object

In [12]:
df['Name'].dtypes

dtype('O')

In [13]:
df.index

RangeIndex(start=0, stop=17, step=1)

In [14]:
df.columns

Index(['Name', 'Designation', 'Gender', 'Age', 'Salary'], dtype='object')

In [15]:
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         17 non-null     object
 1   Designation  17 non-null     object
 2   Gender       17 non-null     object
 3   Age          16 non-null     float64
 4   Salary       15 non-null     float64
dtypes: float64(2), object(3)
memory usage: 812.0+ bytes

In [17]:
df[0:3]#Slicing

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0
1    Azziz     Teacher      M  30.0   35000.0
2   Mohsin    Engineer      M  29.0   50000.0

In [18]:
Copy=df['Age'].copy()
Copy

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11      NaN
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [31]:
One=pd.DataFrame( #Concatenate two frames
    {
     "Name":pd.Series(["Haniya","Anaya","Hayat"]),   
    }
)
Two=pd.DataFrame(
    {
     "Age":pd.Series(['18','19','20']),    
    }
)
data=pd.concat([One, Two], axis=1)
data

     Name Age
0  Haniya  18
1   Anaya  19
2   Hayat  20

In [45]:
left = pd.DataFrame({  
    "Name": ["Fatima", "Ume Hani"],
    "Age": [19, 20]
})

right = pd.DataFrame({  
    "Name": ["Alizay", "Naina"],
    "Age": [21, 22]
})

# Merged two Frames
merged = pd.merge(left, right, on="Name", how="outer", suffixes=('_left', '_right'))
print(merged)

       Name  Age_left  Age_right
0    Alizay       NaN       21.0
1    Fatima      19.0        NaN
2     Naina       NaN       22.0
3  Ume Hani      20.0        NaN

In [48]:
data = pd.DataFrame({
    "Name": ["Fatima", "Ume Hani", "Alizay", "Naina"],
    "Age": [19, 20, 21, 22]
})
pivot = data.pivot_table(index="Name", values="Age") #Pivot_table
print(pivot)

           Age
Name
Alizay    21.0
Fatima    19.0
Naina     22.0
Ume Hani  20.0

In [50]:
data = pd.DataFrame({
    "Date": ["2025-03-15 10:00:00", "2025-03-16 12:00:00", "2025-03-17 15:00:00", "2025-03-18 18:00:00"],
    "Name": ["Fatima", "Ume Hani", "Alizay", "Naina"],
    "Age": [19, 20, 21, 22]
})

# Converting 'Date' to datetime format
data["Date"] = pd.to_datetime(data["Date"])

# Localizing the time zone to 'Asia/Karachi'
data["Date"] = data["Date"].dt.tz_localize("Asia/Karachi")

# Display the DataFrame
print(data)

                       Date      Name  Age
0 2025-03-15 10:00:00+05:00    Fatima   19
1 2025-03-16 12:00:00+05:00  Ume Hani   20
2 2025-03-17 15:00:00+05:00    Alizay   21
3 2025-03-18 18:00:00+05:00     Naina   22